docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-07-27 Sat 17:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Essentials of compilation: An Incremental Approach</title>
<meta name="generator" content="Org mode">
<meta name="author" content="DEADB17">
<link rel="stylesheet" href="org.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Essentials of compilation: An Incremental Approach</h1>
</header>
<div class="ABSTRACT">
<p>
<a href="https://deadb17.github.io/essentials-of-compilation/">Personal notes</a> from reading <a href="https://www.rose-hulman.edu/class/cs/csse404/schedule/Essentials_of_Compilation.pdf">Essentials of Compilation</a>.
</p>
<ul class="org-ul">
<li>From the CSSE 404: Compiler Construction Rose-Hulman Institute of Technology
<a href="https://www.rose-hulman.edu/class/cs/csse404/">Computer Science and Software Engineering Department</a>.</li>
<li><a href="https://github.com/IUCompilerCourse/Essentials-of-Compilation">Source and additional material</a>.</li>
<li>See also Abdulaziz Ghuloum's <a href="http://scheme2006.cs.uchicago.edu/11-ghuloum.pdf">An Incremental Approach to Compiler Construction</a>.</li>
</ul>

</div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a1dd6d">1.5 Interpreter</a></li>
<li><a href="#org97fd0b1">1.6 Example compiler: A partial evaluator</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org8a1dd6d" class="outline-2">
<h2 id="org8a1dd6d">1.5 Interpreter</h2>
<div class="outline-text-2" id="text-org8a1dd6d">
<p>
The interpreter from the book is changed so that <code>(read)</code> takes an argument
specifying what the result of reading would be. This is done so that tests can
be batched instead of needing user intervention.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Interpreter for the R0 language.</label><pre class="src src-racket" id="org001d293">(<span style="color: #b4fa70;">require</span> racket/fixnum)

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">interp-exp</span> e)
  (<span style="color: #e090d7;">match</span> e
    [(? <span style="color: #e090d7;">fixnum?</span>) e]
    [`(<span style="color: #e090d7;">read</span> ,r)
     (<span style="color: #b4fa70;">cond</span> [(<span style="color: #e090d7;">fixnum?</span> r) r]
           [<span style="color: #b4fa70;">else</span> (<span style="color: #e090d7;">error</span> <span style="color: #2e8b57;">'interp-R0</span> <span style="color: #e9b96e;">"input not an integer"</span> r)])]
    [`(<span style="color: #e090d7;">-</span> ,e1) (fx- <span style="color: #2e8b57;">0</span> (interp-exp e1))]
    [`(<span style="color: #e090d7;">+</span> ,e1 ,e2) (fx+ (interp-exp e1) (interp-exp e2))]))

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">interp-R0</span> p)
  (<span style="color: #e090d7;">match</span> p
    [`(program ,e) (interp-exp e)]))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Error <code>fx+: result is not a fixnum</code></label><pre class="src src-racket" id="org44f414d">(<span style="color: #b4fa70;">define</span> <span style="color: #fcaf3e;">large</span> <span style="color: #2e8b57;">999999999999999999</span>)
(interp-R0 `(program (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">+</span> ,large ,large) (<span style="color: #e090d7;">+</span> ,large ,large))
                        (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">+</span> ,large ,large) (<span style="color: #e090d7;">+</span> ,large ,large)))))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Exercise</label><pre class="src src-racket" id="org4e88873">(interp-R0 '(program (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">read</span> <span style="color: #2e8b57;">50</span>) (<span style="color: #e090d7;">-</span> <span style="color: #2e8b57;">8</span>))))
</pre>
</div>

<p>
Result
</p>
<pre class="example">
42
</pre>
</div>
</section>


<section id="outline-container-org97fd0b1" class="outline-2">
<h2 id="org97fd0b1">1.6 Example compiler: A partial evaluator</h2>
<div class="outline-text-2" id="text-org97fd0b1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>A partial evaluator for R0 expressions.</label><pre class="src src-racket" id="orgcdd9a62">(<span style="color: #b4fa70;">require</span> racket/fixnum)

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">pe-neg</span> r)
  (<span style="color: #b4fa70;">cond</span> [(<span style="color: #e090d7;">fixnum?</span> r) (fx- <span style="color: #2e8b57;">0</span> r)]
        [<span style="color: #b4fa70;">else</span> `(<span style="color: #e090d7;">-</span> ,r)]))

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">pe-add</span> r1 r2)
  (<span style="color: #b4fa70;">cond</span> [(<span style="color: #b4fa70;">and</span> (<span style="color: #e090d7;">fixnum?</span> r1) (<span style="color: #e090d7;">fixnum?</span> r2)) (fx+ r1 r2)]
        [<span style="color: #b4fa70;">else</span> `(<span style="color: #e090d7;">+</span> ,r1 ,r2)]))

(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">pe-arith</span> e)
  (<span style="color: #e090d7;">match</span> e
    [(? <span style="color: #e090d7;">fixnum?</span>) e]
    [`(<span style="color: #e090d7;">read</span> ,n) e]
    [`(<span style="color: #e090d7;">-</span> ,(app pe-arith r1))
     (pe-neg r1)]
    [`(<span style="color: #e090d7;">+</span> ,(app pe-arith r1) ,(app pe-arith r2))
     (pe-add r1 r2)]))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Test procedure</label><pre class="src src-racket" id="orgd098279">(<span style="color: #b4fa70;">define</span> (<span style="color: #fce94f;">test-pe</span> p)
  (<span style="color: #b4fa70;">define</span> <span style="color: #fcaf3e;">e</span> (pe-arith p))
  (<span style="color: #b4fa70;">define</span> <span style="color: #fcaf3e;">i</span> (interp-R0 `(program ,p)))
  (<span style="color: #b4fa70;">define</span> <span style="color: #fcaf3e;">r</span> (<span style="color: #b4fa70;">if</span> (<span style="color: #e090d7;">equal?</span> i (interp-R0 `(program ,e))) <span style="color: #e9b96e;">"#t"</span> <span style="color: #e9b96e;">"#f"</span>))
  (<span style="color: #e090d7;">list</span> p e i r))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Tests</label><pre class="src src-racket" id="org7e7e103">(test-pe '(<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">13</span> (<span style="color: #e090d7;">-</span> <span style="color: #2e8b57;">9</span>)))
(test-pe '(<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">1</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">2</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">3</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">4</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">5</span> (<span style="color: #e090d7;">-</span> <span style="color: #2e8b57;">5</span>)))))))
(test-pe '(<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">read</span> <span style="color: #2e8b57;">1</span>) <span style="color: #2e8b57;">2</span>))
(test-pe '(<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">read</span> <span style="color: #2e8b57;">1</span>) (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">1</span> (<span style="color: #e090d7;">+</span> <span style="color: #2e8b57;">1</span> <span style="color: #2e8b57;">1</span>)) (<span style="color: #e090d7;">+</span> (<span style="color: #e090d7;">read</span> <span style="color: #2e8b57;">2</span>) (<span style="color: #e090d7;">-</span> <span style="color: #2e8b57;">1</span>)))))
</pre>
</div>

<table>
<caption class="t-above"><span class="table-number">Table 1:</span> Test results</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">expression</th>
<th scope="col" class="org-left">partial eval</th>
<th scope="col" class="org-right">result</th>
<th scope="col" class="org-left">eval eq?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(+ 13 (- 9))</td>
<td class="org-left">4</td>
<td class="org-right">4</td>
<td class="org-left">#t</td>
</tr>

<tr>
<td class="org-left">(+ 1 (+ 2 (+ 3 (+ 4 (+ 5 (- 5))))))</td>
<td class="org-left">10</td>
<td class="org-right">10</td>
<td class="org-left">#t</td>
</tr>

<tr>
<td class="org-left">(+ (read 1) 2)</td>
<td class="org-left">(+ (read 1) 2)</td>
<td class="org-right">3</td>
<td class="org-left">#t</td>
</tr>

<tr>
<td class="org-left">(+ (read 1) (+ (+ 1 (+ 1 1)) (+ (read 2) (- 1))))</td>
<td class="org-left">(+ (read 1) (+ 3 (+ (read 2) -1)))</td>
<td class="org-right">5</td>
<td class="org-left">#t</td>
</tr>
</tbody>
</table>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: DEADB17 (<a href="mailto:DEADB17@gmail.com">DEADB17@gmail.com</a>)</p>
<p class="date">Date: 2019-07-27 Sat 00:00</p>
<p class="creator">Emacs 26.2 (Org mode 9.2.4)</p>
<p class="validation"></p>
</div>
</body>
</html>